[
  {
    "id": "1",
    "title": "PUBG Mobile",
    "coverPhoto": "https://i.ibb.co.com/7dcpyGxq/id1.jpg",
    "category": "FPS",
    "downloadLink": "https://www.pubgmobile.com/en-US/home.shtml",
    "description": "PUBG Mobile is an intense, fast-paced battle royale game where players are dropped onto large maps aiming to be the last one standing. Players gather weapons, armor, and resources while navigating shrinking safe zones and avoiding ambushes. Quick thinking, tactical decisions, and precise aiming are essential. Teamwork is vital in squad mode, while solo players rely on skill. Dynamic maps, weather, and encounters keep gameplay fresh. Frequent updates add new content, events, and features for a competitive, engaging experience worldwide.",
    "ratings": "4.5",
    "developer": "Krafton"
  },
  {
    "id": "2",
    "title": "Fortnite",
    "coverPhoto": "https://i.ibb.co.com/HTMbKHLm/id2.png",
    "category": "Battle Royale",
    "downloadLink": "https://www.epicgames.com/fortnite",
    "description": "Fortnite is a vibrant battle royale game blending shooting, building, and strategic survival on colorful, dynamic maps. Players collect weapons, resources, and construct structures to outlast opponents. Solo, duo, and squad modes emphasize tactics and creativity. Frequent updates bring new skins, weapons, events, and limited-time modes, keeping gameplay fresh. Teamwork, adaptability, and skill mastery are crucial. Competitive tournaments and social interactions enrich the experience. Its continuous evolution and engaging mechanics make Fortnite one of the most enduring and popular games globally.",
    "ratings": "4.7",
    "developer": "Epic Games"
  },
  {
    "id": "3",
    "title": "Call of Duty: Mobile",
    "coverPhoto": "https://i.ibb.co.com/7JFyJ0pq/id3.jpg",
    "category": "FPS",
    "downloadLink": "https://www.callofduty.com/mobile",
    "description": "Call of Duty: Mobile delivers high-quality FPS gameplay on mobile with iconic maps, modes, and weapons from the franchise. Players engage in fast-paced multiplayer battles including Team Deathmatch, Battle Royale, and Ranked modes, requiring strategy, reflexes, and precise aiming. Loadout customization, character progression, and weapon unlocks give tactical advantages. Seasonal updates add new operators, events, and content. The game emphasizes teamwork, coordination, and skill, providing a competitive, immersive mobile FPS experience that mirrors console and PC intensity worldwide.",
    "ratings": "4.6",
    "developer": "Activision"
  },
  {
    "id": "4",
    "title": "Dota 2",
    "coverPhoto": "https://i.ibb.co.com/v6J7vWrd/id8.jpg",
    "category": "MOBA",
    "downloadLink": "https://www.dota2.com",
    "description": "Dota 2 is a highly competitive MOBA where two teams of five control unique heroes with distinct abilities. Players strategize to destroy the enemy Ancient while defending their own, requiring teamwork, timing, and precise skill. Dynamic maps, evolving objectives, and numerous heroes ensure each match is unique. Coordination, adaptability, and tactical execution determine outcomes. The game features professional tournaments, community events, and regular updates introducing new heroes, items, and mechanics. Dota 2 provides engaging, strategic gameplay suitable for casual players and esports professionals globally.",
    "ratings": "4.7",
    "developer": "Valve Corporation"
  },
  {
    "id": "5",
    "title": "Minecraft",
    "coverPhoto": "https://i.ibb.co.com/j9HCpgfs/id5.jpg",
    "category": "Sandbox",
    "downloadLink": "https://www.minecraft.net",
    "description": "Minecraft is a sandbox game where players explore vast, procedurally generated worlds made of blocks, gathering resources, crafting tools, and building structures. Players can survive alone or collaborate in multiplayer servers, designing anything from homes to entire cities. Modes include Survival, Creative, and Adventure, encouraging exploration, creativity, and problem-solving. Dynamic weather, day-night cycles, and hostile mobs provide challenges, while the redstone system enables automation. Regular updates expand biomes, creatures, and mechanics, inspiring imagination, collaboration, and endless creativity worldwide for players of all ages.",
    "ratings": "4.8",
    "developer": "Mojang Studios"
  },
  {
    "id": "6",
    "title": "Roblox",
    "coverPhoto": "https://i.ibb.co.com/MD0PFcVC/id6.jpg",
    "category": "Sandbox / Creator",
    "downloadLink": "https://www.roblox.com",
    "description": "Roblox is an online platform allowing players to create, share, and explore countless user-generated games across genres. Using Roblox Studio, users design environments, program mechanics, and customize avatars. Players socialize, compete, and cooperate in virtual worlds, challenges, role-playing, or mini-games. Frequent updates introduce tools, events, and features, keeping the platform dynamic. Its community-driven approach promotes creativity, learning, and collaboration. Accessible on multiple devices, Roblox offers endless content, social interaction, and imaginative exploration, delivering immersive entertainment for users of all ages worldwide.",
    "ratings": "4.4",
    "developer": "Roblox Corporation"
  },
  {
    "id": "7",
    "title": "Apex Legends",
    "coverPhoto": "https://i.ibb.co.com/Tx54KCKD/id7.jpg",
    "category": "Battle Royale",
    "downloadLink": "https://www.ea.com/games/apex-legends",
    "description": "Apex Legends is a fast-paced battle royale where squads of three select unique Legends with special abilities. Teams compete to be the last squad standing on dynamic maps filled with weapons, loot, and environmental hazards. Tactical decision-making, communication, and combat skills are essential. Regular updates introduce new Legends and limited-time modes, maintaining excitement. Players balance aggression with strategy, mastering movement, shooting, and teamwork. Apex Legends features polished gameplay, immersive audiovisual design, and a strong esports presence, captivating players worldwide with competitive and engaging battles.",
    "ratings": "4.5",
    "developer": "Respawn Entertainment"
  },
  {
    "id": "8",
    "title": "Genshin Impact",
    "coverPhoto": "https://i.ibb.co.com/DHbbCPQs/id4.jpg",
    "category": "Open World RPG",
    "downloadLink": "https://genshin.hoyoverse.com",
    "description": "Genshin Impact is an open-world action RPG set in a visually stunning fantasy universe featuring elemental magic, exploration, and challenging combat. Players control a diverse cast of characters, each with unique abilities, solving puzzles, completing dungeons, and defeating bosses. Strategic combat, character progression, and resource management are essential. Dynamic landscapes, weather, and day-night cycles enhance exploration. Frequent updates add new regions, characters, and challenges. Solo and cooperative play offer immersive adventures, ensuring ongoing engagement and captivating gameplay for players around the world.",
    "ratings": "4.7",
    "developer": "HoYoverse"
  },
  {
    "id": "9",
    "title": "World of Warcraft",
    "coverPhoto": "https://i.ibb.co.com/dJbVTkn1/id9.jpg",
    "category": "MMORPG",
    "downloadLink": "https://worldofwarcraft.com/en-us/battle-for-azeroth",
    "description": "World of Warcraft: Battle for Azeroth is a massive MMORPG expansion where players explore new continents, undertake quests, and engage in large-scale faction battles. Choosing Alliance or Horde, players unlock storylines, dungeons, and raids while leveling characters and acquiring gear. Strategy, teamwork, and exploration are crucial in PvE and PvP modes. Guilds, world events, and cooperative objectives enhance gameplay. Regular updates expand the world and add new content, delivering a compelling, enduring MMORPG experience that engages millions of players across the globe.",
    "ratings": "4.6",
    "developer": "Blizzard Entertainment"
  },
  {
    "id": "10",
    "title": "Clash Royale",
    "coverPhoto": "https://i.ibb.co.com/mCCmmCWg/id10.jpg",
    "category": "Strategy",
    "downloadLink": "https://supercell.com/en/games/clashroyale/",
    "description": "Clash Royale is a real-time strategy game combining card collection, tower defense, and multiplayer battles. Players deploy troops, spells, and buildings to destroy enemy towers while defending their own. Timing, resource management, and strategic placement are essential. Matches are short but intense, requiring constant adaptation. Clans, events, and tournaments foster collaboration and competition. Frequent updates add new cards, arenas, and challenges. Clash Royale’s tactical depth, accessibility, and engaging visuals make it one of the most popular competitive mobile strategy games worldwide.",
    "ratings": "4.5",
    "developer": "Supercell"
  },
  {
    "id": "11",
    "title": "Among Us",
    "coverPhoto": "https://i.ibb.co.com/NnVTCvxn/id11.jpg",
    "category": "Social Deduction",
    "downloadLink": "https://www.innersloth.com/gameAmongUs.php",
    "description": "Among Us is a social deduction game where players complete tasks on a spaceship while identifying impostors secretly sabotaging the crew. Impostors aim to eliminate crewmates without detection. Players observe, communicate, and vote strategically during meetings. Balancing trust and suspicion is key, requiring teamwork and deduction. Online and local multiplayer modes foster social interaction, discussion, and collaboration. Frequent updates add maps, tasks, and cosmetics. Among Us has become a global phenomenon, delivering engaging, suspenseful, and fun experiences for players of all ages.",
    "ratings": "4.3",
    "developer": "Innersloth"
  },
  {
    "id": "12",
    "title": "Valorant",
    "coverPhoto": "https://i.ibb.co.com/qZBSvks/id12.jpg",
    "category": "Tactical FPS",
    "downloadLink": "https://playvalorant.com",
    "description": "Valorant is a tactical FPS combining precise gunplay with unique agent abilities in team-based competitive matches. Players coordinate strategies to plant or defuse spikes while eliminating opponents, emphasizing skill, timing, and communication. Ranked and unranked modes encourage continuous improvement and competitive play. Frequent updates introduce new agents, maps, and seasonal events, keeping gameplay fresh. Valorant’s esports presence and dedicated player base highlight its immersive, strategic, and challenging experience, requiring team coordination and tactical execution to succeed in every match.",
    "ratings": "4.7",
    "developer": "Riot Games"
  }
]